{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft": "Warning",
      "Microsoft.Hosting.Lifetime": "Information"
    }
  },
  "AllowedHosts": "*",
  "ApplicationSettings": {
    "ApplicationTitle": "BugTracker.NET",

    /*
      Set WindowsAuthentication to "Windows" if you want to use windows authentication instead of the logon page.

      1) Configure your IIS virtual directory so that anon access is unchecked and windows authentication is checked
      2) Configure IE to automatically send username and password
      3) Usernames in users table should match your windows usernames. Passwords in users table will be ignored.

      If you want BOTH modes to work, set "WindowsAuthentication" to "Both".

      Configure your IIS virtual directory as normal (allowing anon access). Follow these instructions for the file "Account/LoginNt":

      * From IIS Manager, right-click the file Account/LoginNt and select properties
      * Select the Security tab
      * Click Edit in the Anonymous Access and Authentication frame
      * Ensure Anonymous Access and Basic Authentication is cleared
      * Ensure Integrated Windows Authentication is selected
      * Click OK
      * Select the Custom Errors tab
      * Select HTTP Error 401;2 and click Edit Properties
      * Set the message type to File and select the file login.htm, including the full local path. (Note that this must be a file reference and not a URL)

      The idea is that when the user access Account/Login, it redirects to Account/LoginNt.
      When access to Account/LoginNt is denied, IIS responds with the custom error login.htm.
      Login.htm then redirects to Account/Login.
    */
    "WindowsAuthentication": "Site",

    /*
      There's a special user in the database, "guest". Think of it as a user account that can
      be shared by several people. The guest user can't save settings and can't save searches.
      If "AllowGuestWithoutLogin" is set to "false", and if you set the guest user to active,
      then the guest user still has to login with a password. If set to "true", then the guest 
      user doesn't need to even enter a password. Instead, a link will appear on the login page, 
      Account/Login, saying:

      Continue as "guest" without logging in

      You can control the per-project permissions of the guest user in the same way as other
      users EXCEPT that even if you give the guest user permissions beyond View Only and Reporter,
      the system will automatically reduce his permissions downward.
    */
    "AllowGuestWithoutLogin": false,

    /*
      Allow people to self-register.
      You must also set "SelfRegisteredUserTemplate".
      You should also consider setting "RequireStrongPasswords"
    */
    "AllowSelfRegistration": false,

    /*
      When creating a new user as a result of a self-registration,
      use an existing user's settings, permissions, etc as a template
      for the new user
    */
    "SelfRegisteredUserTemplate": "guest",

    /*
      Number of minutes a new user has between the time they register
      and the time they must confirm the registration by clicking on
      the link they received by email
    */
    "RegistrationExpiration": 20,

    /*
      Show "Forgot password?" link.
    */
    "ShowForgotPasswordLink": false
  }
}
